# Lambda
users = [
    ('Сидоров', [4, 5, 5, 5, 4]),
    ('Иванов', [2, 3, 4, 5, 3]),
    ('Петров', [3, 4, 3, 3, 3]),
]

res = [(z[0], sum(z[1])) for z in users]
print(res)
# [('Сидоров', 23), ('Иванов', 17), ('Петров', 16)]
print(sorted(res))
# [('Иванов', 17), ('Петров', 16), ('Сидоров', 23)]
print(sorted(res, key=lambda x: x[1]))
# [('Петров', 16), ('Иванов', 17), ('Сидоров', 23)]

print(sorted(users, key=lambda x: sum(x[1])))
# [('Петров', [3, 4, 3, 3, 3]), ('Иванов', [2, 3, 4, 5, 3]), ('Сидоров', [4, 5, 5, 5, 4])]

print(list((k, sorted(v)) for (k, v) in sorted(users, key=lambda x: sum(x[1]))))
# [('Петров', [3, 3, 3, 3, 4]), ('Иванов', [2, 3, 3, 4, 5]), ('Сидоров', [4, 4, 5, 5, 5])]

