# 1
# Зашифруем простой print
print("Hello, world!")

# 2
# Команда, которую нужно выполнить - это просто строка
text = 'print("Hello, world!")'
# Строку можно выполнить небезопасной функцией eval()
eval(text)

# 3
# Каждый символ строки запишем в виде его ASCII-кода. В качестве разделителя будем использовать точку
shiper_str = '.'.join(str(ord(ch)) for ch in text)
# Должна получиться такая строка. Её уже можно передавать, не надеясь, что нас раскроют
# 112.114.105.110.116.40.34.72.101.108.108.111.44.32.119.111.114.108.100.33.34.41

# Эту строку можно выполнить, если провести последовательность обратных преобразований
# Создаём строку а потом её выполняем
eval(''.join(chr(int(ch)) for ch in shiper_str.split('.')))
# Создаём последовательность байт и выполняем команду
exec(bytes(int(ch) for ch in shiper_str.split('.')))

# 4
# Будем использовать в качестве числа, последовательность восклицательных знаков. Сколько знаков, такой код символа
shiper_str = '.'.join('!' * ord(ch) for ch in text)
# Получится такая строка. Её также можно безопасно передавать
# !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!#

# Эту строку также можно выполнить, если провести последовательность обратных преобразований
# Создаём последовательность байт и выполняем команду
exec(bytes(len(ch) for ch in shiper_str.split('.')))

# В случаях, когда передаются коды символов или подозрительные последовательности одинаковых символов, намерения могут быстро раскрыты.

# 5
# Будем использовать в качестве числа, последовательность пробелов, а в качестве разделителя - табуляцию
shiper_str = '\t'.join(' ' * ord(ch) for ch in text)
# Получится такая строка. Её также можно безопасно передавать. На первый взгляд это пустая строка, но нет
#                                                                                                                 	                                                                                                                  	                                                                                                         	                                                                                                              	                                                                                                                    	                                        	                                  	                                                                        	                                                                                                     	                                                                                                            	                                                                                                            	                                                                                                               	                                            	                                	                                                                                                                       	                                                                                                               	                                                                                                                  	                                                                                                            	                                                                                                    	                                 	                                  	                                         #

# Эту строку также можно выполнить, если провести последовательность обратных преобразований
# Создаём последовательность байт и выполняем команду
exec(bytes(len(ch) for ch in shiper_str.split('\t')))

# NB
# Современные системы защиты смотрят не на содержимое переменной, а на системный вызов exec() или bytes() с необычными аргументами
# Если Python выполняет exec(bytes(...)) то, система детектирует это как аномалию - использование exec с динамически собранными данными


